package level8.task0701;


//Как тебе уже известно, всего в языке Java 8 примитивных типов.
//        Создай по одной переменной каждого примитивного типа в классе Solution.
//        Переменные не должны находиться в каком-либо методе.
//
//        Требования:
//        •	В классе Solution должны быть созданы переменные всех примитивных типов.

/*
Все возможные типы
*/

public class Solution {
    //напишите тут ваш код
    byte a;
    short b;
    int c;
    long m;
    float d;
    double e;
    boolean k;
    char l;
}